Repository: radiolicencja/radiolicencja
Catalog: lib/l10n/app_*.arb
Languages: pl

# topicListTitle
source: Learning Topics
pl: Tematy nauki

# topicLoadError
source: Unable to load topics. {error}
pl: Nie udało się wczytać tematów. {error}

# topicListEmpty
source: Add topic files to assets/topics to get started.
pl: Dodaj pliki tematów do assets/topics, aby rozpocząć.

# topicNoQuestions
source: This topic has no questions yet. Add some to begin.
pl: Ten temat nie ma jeszcze pytań. Dodaj je, aby zacząć.

# topicQuestionCount
source: {count, plural, one {{count} question} other {{count} questions}}
pl: {count, plural, one {{count} pytanie} few {{count} pytania} other {{count} pytań}}

# topicProgress
source: {mastered} / {total} learned
pl: Opanowano {mastered} z {total}

# topicConfidence
source: Confidence {percent}%
pl: Pewność {percent}%

# topicResetProgress
source: Reset progress
pl: Wyzeruj postęp

# topicResetDialogTitle
source: Reset learning progress?
pl: Wyzerować postęp?

# topicResetDialogBody
source: This removes learned questions for {topic}.
pl: To usunie opanowane pytania dla tematu {topic}.

# topicResetDialogConfirm
source: Reset
pl: Wyzeruj

# topicResetDialogCancel
source: Cancel
pl: Anuluj

# topicStatsButtonLabel
source: Statistics
pl: Statystyki

# topicStatsTitle
source: Learning statistics
pl: Statystyki nauki

# topicStatsEmpty
source: No answers recorded yet.
pl: Brak zarejestrowanych odpowiedzi.

# topicStatsSummary
source: Answered {answered} times ({correct} correct / {incorrect} incorrect)
pl: Odpowiedziano {answered} razy ({correct} poprawnie / {incorrect} błędnie)

# topicStatsAccuracy
source: Accuracy: {percent}% ({correct}/{total})
pl: Skuteczność: {percent}% ({correct}/{total})

# topicStatsLastSeen
source: Last seen: {time}
pl: Ostatnio widziane: {time}

# topicStatsNeverSeen
source: Never seen yet
pl: Jeszcze nie wyświetlone

# topicStatsCorrectAnswer
source: Correct answer: {answer}
pl: Poprawna odpowiedź: {answer}

# topicStatsNoCorrectAnswer
source: Correct answer not provided
pl: Brak poprawnej odpowiedzi

# modeSheetTestTitle
source: Take test
pl: Test

# modeSheetTestSubtitle
source: Standard quiz, questions asked once.
pl: Standardowy quiz, pytania tylko raz.

# modeSheetLearningTitle
source: Learning mode
pl: Tryb nauki

# modeSheetLearningSubtitle
source: Retry incorrect questions until you master all.
pl: Powtarzaj błędne pytania, aż wszystkie opanujesz.

# quizNoQuestionsAvailable
source: No questions available for this topic yet.
pl: Brak pytań dla tego tematu.

# quizQuestionProgress
source: Question {current} of {total}
pl: Pytanie {current} z {total}

# quizLearningProgress
source: Mastered {mastered} of {total}
pl: Opanowano {mastered} z {total}

# quizCorrectAnswerLabel
source: Correct answer: {label}. {answer}
pl: Poprawna odpowiedź: {label}. {answer}

# quizButtonSeeScore
source: See score
pl: Zobacz wynik

# quizButtonNextQuestion
source: Next question
pl: Następne pytanie

# quizButtonCheckAnswer
source: Check answer
pl: Sprawdź odpowiedź

# quizButtonCorrect
source: Correct!
pl: Poprawnie!

# quizButtonIDontKnow
source: I don't know
pl: Nie wiem

# quizAcceptedAnswersLabel
source: Accepted answers: {answers}
pl: Akceptowane odpowiedzi: {answers}

# quizWrongAnswerLabel
source: Not quite right.
pl: To nie to.

# quizYourAnswerLabel
source: Your answer
pl: Twoja odpowiedź

# quizAutoAdvanceHint
source: Advancing in {seconds}s - tap anywhere to keep reading
pl: Przechodzę dalej za {seconds}s - stuknij, aby zatrzymać

# quizLearningCompleteTitle
source: Learning session complete!
pl: Zakończono naukę!

# quizTestCompleteTitle
source: Quiz complete!
pl: Koniec quizu!

# quizLearningCompleteBody
source: You mastered all {total} questions.
pl: Opanowałeś wszystkie {total} pytania.

# quizTestCompleteBody
source: You answered {score} of {total} correctly.
pl: Odpowiedziałeś poprawnie na {score} z {total}.

# quizBackToTopicsButton
source: Back to topics
pl: Wróć do tematów

# aboutButtonLabel
source: About
pl: O aplikacji

# aboutTitle
source: About Radio Licencja
pl: O Radio Licencja

# aboutLead
source: Radio Licencja is a lightweight study companion for the Polish amateur radio exam. It loads quizzes from local library and offers both exam-style tests and a spaced-repetition learning mode.
pl: Radio Licencja to lekki towarzysz nauki do polskiego egzaminu krótkofalarskiego. Wczytuje quizy z lokalnych plików i oferuje tryb testu oraz naukę opartą na powtórkach w czasie.

# aboutSecondary
source: Use it to revisit the whole question bank, drill weak spots with instant explanations, and track how your confidence grows over time.
pl: Wykorzystaj go do powtórek całej puli pytań, szybkiego utrwalania słabszych miejsc z wyjaśnieniami i obserwowania, jak rośnie Twoja pewność.

# aboutAuthorLabel
source: Author
pl: Autor

# aboutAuthorCredit
source: Created and maintained by SP7SMI (Marek Åšmigielski).
pl: Twórca i opiekun: SP7SMI.

# aboutWebsiteLabel
source: Website
pl: Strona

# aboutLinkOpenError
source: Couldn't open link. Copy and paste instead.
pl: Nie udało się otworzyć linku. Skopiuj i wklej ręcznie.

# aboutDisclaimer
source: Answer explanations are generated by AI and may contain errors. Please verify them yourself.
pl: Wyjaśnienia odpowiedzi generuje AI i mogą zawierać błędy. Zweryfikuj je samodzielnie.
